#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/terrastates/QuackyNotesInfra/runs/run-Hd3R8z7G7xRoscRF

Waiting for the plan to start...

Terraform v1.4.4
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # random_id.server_PR_1 will be created
  + resource "random_id" "server_PR_1" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "ami_id" = "ami-007855ac798b5175e"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
╷
│ Error: Invalid AWS Region: eu-east-1
│ 
│   with provider["registry.terraform.io/hashicorp/aws"],
│   on main.tf line 43, in provider "aws":
│   43: provider "aws" {
│ 
╵
Operation failed: failed running terraform plan (exit 1)

```

</details>

*Pusher: @AndresDavidArcos, Action: `workflow_dispatch`*